ITHACA-FV/tutorials/CFD/04unsteadyNS/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(1.00126 -0.000928661 0)
(1.00126 -0.00278234 0)
(1.00125 -0.00462432 0)
(1.00123 -0.00644415 0)
(1.0012 -0.00822733 0)
(1.00115 -0.00995367 0)
(1.00108 -0.0115955 0)
(1.00099 -0.0131163 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
